
//Basic function for converting Extended Latin Character from Serbia, Croatia, Bosnia to cyrilic
function latinica_u_cirilicu($str)
{
    $tr = array(
        "А"=>"A", "B"=>"Б", "V"=>"В", "G"=>"Г", "D"=>"Д", "DJ"=>"Ђ", "Dj"=>"Ђ", "Đ"=>"Ђ", 
        "Е"=>"Е", "Ž"=>"Ж", "Z"=>"З", "I"=>"И", "J"=>"Ј", "K"=>"К", 
        "L"=>"Л", "LJ"=>"Љ", "Lj"=>"Љ", "M"=>"М", "N"=>"Н", "NJ"=>"Њ", "Nj"=>"Њ", 
        "O"=>"О", "P"=>"П", "R"=>"Р", "S"=>"С", "T"=>"Т", "Ć"=>"Ћ", 
        "U"=>"У", "F"=>"Ф", "H"=>"Х", "C"=>"Ц", "Č"=>"Ч", "DŽ"=>"Џ", "Dž"=>"Џ","Š"=>"Ш", 
        "a"=>"а", "b"=>"б", "v"=>"в", "g"=>"г", "d"=>"д", "dj"=>"ђ", "đ"=>"ђ", 
        "e"=>"е", "ž"=>"ж", "z"=>"з", "i"=>"и", "j"=>"ј", "k"=>"к", "l"=>"л", "lj"=>"љ", 
        "m"=>"м", "n"=>"н", "nj"=>"њ", "o"=>"о", "p"=>"п", "r"=>"р", "s"=>"с", 
        "t"=>"т", "ć"=>"ћ", "u"=>"у", "f"=>"ф", "h"=>"х", "c"=>"ц", "č"=>"ч", 
        "dž"=>"џ", "š"=>"ш"
    );
return strtr($str,$tr);
}
